Revit 2026 API

# RebarContainerItemGetHookOrientation Method

---

**Note: This API is now obsolete.**

Returns the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarContainerItem.GetTerminationOrientation(int end) instead.")]
public RebarHookOrientation GetHookOrientation(
	int end
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarContainerItem.GetTerminationOrientation(int end) instead.")>
Public Function GetHookOrientation (
	end As Integer
) As RebarHookOrientation
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarContainerItem.GetTerminationOrientation(int end) instead.")]
RebarHookOrientation GetHookOrientation(
	int end
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarContainerItem.GetTerminationOrientation(int end) instead.")>]
member GetHookOrientation :
        end : int -> RebarHookOrientation
```

#### Parameters

end Int32
     0 for the start hook, 1 for the end hook.

#### Return Value

RebarHookOrientation Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1. |

#### Reference

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace